app/controllers/articles_controller.rb

	def create
		#basicly recover the data inside the form widget
		@article = Article.new(article_params)

		# if data was not saved correctly, allow them to try again
		if @article.save
---
INSERT INTO "articles" ("title", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "First Title id=1"], ["status", nil], ["created_at", "2023-08-19 22:20:27.220464"], ["updated_at", "2023-08-19 22:20:27.220464"]]